In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hi\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\hi\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

# series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']

In [3]:
my_data=[10,12,17]

In [4]:
arr=np.array(my_data)

In [5]:
arr

array([10, 12, 17])

In [6]:
d={'a':10,'b':12,'c':17}

In [8]:
d

{'a': 10, 'b': 12, 'c': 17}

In [10]:
pd.Series(data=my_data)

0    10
1    12
2    17
dtype: int64

In [11]:
pd.Series(data=my_data,index=labels)

a    10
b    12
c    17
dtype: int64

In [12]:
pd.Series(my_data,labels)

a    10
b    12
c    17
dtype: int64

In [19]:
pd.Series(arr,labels)

a    10
b    12
c    17
dtype: int32

In [22]:
pd.Series(d)  # it take key as index and value as data

a    10
b    12
c    17
dtype: int64

In [23]:
d

{'a': 10, 'b': 12, 'c': 17}

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [25]:
pd.Series(data=[sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],['bd','ind','aus','pak'])

In [15]:
ser1

bd     1
ind    2
aus    3
pak    4
dtype: int64

In [16]:
ser2=pd.Series([1,2,8,7,5],['usa','ind','italy','japan','pak'])

In [17]:
ser2

usa      1
ind      2
italy    8
japan    7
pak      5
dtype: int64

In [19]:
ser1['aus']

3

In [21]:
ser2['pak']

5

In [46]:
ser3 = pd.Series(data = labels)

In [47]:
ser3

0    a
1    b
2    c
dtype: object

In [48]:
ser3[1]

'b'

In [51]:
ser1 + ser2 # index add that are match ,if don't match return NaN data

aus      NaN
bd       NaN
ind      4.0
italy    NaN
japan    NaN
pak      9.0
usa      NaN
dtype: float64

#  Data Frames

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df=pd.DataFrame(randn(4,4),['a','b','c','d'],['w','x','y','z'])

In [8]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [41]:
df['z']

a   -2.141212
b    1.292765
c    0.485809
d    1.541990
Name: z, dtype: float64

In [42]:
df[['z','w']]

          z         w
a -2.141212 -1.382920
b  1.292765  0.992573
c  0.485809 -1.467514
d  1.541990  0.392489

In [43]:
df.z

a   -2.141212
b    1.292765
c    0.485809
d    1.541990
Name: z, dtype: float64

In [60]:
# creating new column 

df['new'] = df['w']+df['z']

In [47]:
df

          w         x         y         z       new
a -1.382920  1.482495  0.961458 -2.141212 -3.524132
b  0.992573  1.192241 -1.046780  1.292765  2.285338
c -1.467514 -0.494095 -0.162535  0.485809 -0.981705
d  0.392489  0.221491 -0.855196  1.541990  1.934479

In [61]:
# removing column 

df.drop('new',axis=1,inplace=True)  # axis =1 is column

In [58]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765
c -1.467514 -0.494095 -0.162535  0.485809

In [63]:
df.drop('c',axis=0,inplace=True)  # axis =0 is row

In [64]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [65]:
# print row

df.loc['a']

w   -1.382920
x    1.482495
y    0.961458
z   -2.141212
Name: a, dtype: float64

In [66]:
df.loc[['a','b']]

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [67]:
df.iloc[1]

w    0.992573
x    1.192241
y   -1.046780
z    1.292765
Name: b, dtype: float64

In [68]:
df.loc['b','y']

-1.0467795376984979

In [69]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [72]:
df.loc[['a','b'],['x','y']]

          x         y
a  1.482495  0.961458
b  1.192241 -1.046780

# conditional selection

In [9]:
df=pd.DataFrame(randn(4,4),['a','b','c','d'],['w','x','y','z'])

In [10]:
df

          w         x         y         z
a  0.190794  1.978757  2.605967  0.683509
b  0.302665  1.693723 -1.706086 -1.159119
c -0.134841  0.390528  0.166905  0.184502
d  0.807706  0.072960  0.638787  0.329646

In [76]:
df<0

       w     x      y      z
a  False  True   True  False
b  False  True   True  False
c   True  True  False   True
d  False  True   True   True

In [77]:
df>0

       w      x      y      z
a   True  False  False   True
b   True  False  False   True
c  False  False   True  False
d   True  False  False  False

In [78]:
df['x']<0

a    True
b    True
c    True
d    True
Name: x, dtype: bool

In [80]:
df['x']

a   -0.538235
b   -0.905100
c   -0.866885
d   -1.115710
Name: x, dtype: float64

In [82]:
df[df['z']<0]

          w         x         y         z
c -1.972605 -0.866885  0.720788 -1.223082
d  1.606780 -1.115710 -1.385379 -1.329660

In [85]:
restltdf=df[df['w']>0]

In [87]:
restltdf

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660

In [89]:
df[df['w']>0][['y','x']]

          y         x
a -0.568581 -0.538235
b -0.391157 -0.905100
d -1.385379 -1.115710

In [96]:
df[(df['w']>0) & (df['y']<0)]

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660

In [97]:
df[(df['w']>0) | (df['y']<0)]

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660

# Index

In [11]:
df

          w         x         y         z
a  0.190794  1.978757  2.605967  0.683509
b  0.302665  1.693723 -1.706086 -1.159119
c -0.134841  0.390528  0.166905  0.184502
d  0.807706  0.072960  0.638787  0.329646

In [12]:
df.reset_index()

  index         w         x         y         z
0     a  0.190794  1.978757  2.605967  0.683509
1     b  0.302665  1.693723 -1.706086 -1.159119
2     c -0.134841  0.390528  0.166905  0.184502
3     d  0.807706  0.072960  0.638787  0.329646

In [16]:
newind= 'ca ny wy or'.split()

In [17]:
newind

['ca', 'ny', 'wy', 'or']

In [18]:
df['States']=newind

In [19]:
df

          w         x         y         z States
a  0.190794  1.978757  2.605967  0.683509     ca
b  0.302665  1.693723 -1.706086 -1.159119     ny
c -0.134841  0.390528  0.166905  0.184502     wy
d  0.807706  0.072960  0.638787  0.329646     or

In [20]:
df.set_index('States')

               w         x         y         z
States
ca      0.190794  1.978757  2.605967  0.683509
ny      0.302665  1.693723 -1.706086 -1.159119
wy     -0.134841  0.390528  0.166905  0.184502
or      0.807706  0.072960  0.638787  0.329646

In [21]:
df

          w         x         y         z States
a  0.190794  1.978757  2.605967  0.683509     ca
b  0.302665  1.693723 -1.706086 -1.159119     ny
c -0.134841  0.390528  0.166905  0.184502     wy
d  0.807706  0.072960  0.638787  0.329646     or

# Multi_Index

In [36]:
outside=['G1','G1','G1','G4','G4','G4']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G4', 1),
            ('G4', 2),
            ('G4', 3)],
           )

In [38]:
df = pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [39]:
df

             a         b
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G4 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [42]:
df.loc['G1']

          a         b
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [41]:
df.loc['G4']

          a         b
1 -0.755325 -0.346419
2  0.147027 -0.479448
3  0.558769  1.024810

In [43]:
df.index.names = ['groups','num']

In [44]:
df

                   a         b
groups num
G1     1    1.025984 -0.156598
       2   -0.031579  0.649826
       3    2.154846 -0.610259
G4     1   -0.755325 -0.346419
       2    0.147027 -0.479448
       3    0.558769  1.024810

In [48]:
df.loc['G4'].loc[2]['b']

-0.47944803904109595

In [49]:
df.xs('G1') # cross section

            a         b
num
1    1.025984 -0.156598
2   -0.031579  0.649826
3    2.154846 -0.610259

In [51]:
df.xs(1,level='num')

               a         b
groups
G1      1.025984 -0.156598
G4     -0.755325 -0.346419

# Missing Data

In [60]:
d = {'a':[1,2,np.nan],'b':[3,np.nan,np.nan],'c':[1,3,6],'d':[3,4,np.nan]}

In [61]:
df=pd.DataFrame(d)

In [62]:
df

     a    b  c    d
0  1.0  3.0  1  3.0
1  2.0  NaN  3  4.0
2  NaN  NaN  6  NaN

In [63]:
df.dropna()

     a    b  c    d
0  1.0  3.0  1  3.0

In [64]:
df.dropna(axis=1)

   c
0  1
1  3
2  6

In [65]:
df.dropna(axis=0)

     a    b  c    d
0  1.0  3.0  1  3.0

In [68]:
df.dropna(thresh=2)

     a    b  c    d
0  1.0  3.0  1  3.0
1  2.0  NaN  3  4.0

In [69]:
df.fillna(value='fill value' )

            a           b  c           d
0         1.0         3.0  1         3.0
1         2.0  fill value  3         4.0
2  fill value  fill value  6  fill value

In [70]:
df['a']

0    1.0
1    2.0
2    NaN
Name: a, dtype: float64

In [72]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

# Groupby

In [75]:
data = {'company':['goog','goog','msft','msft','fb','fb'],'person':['sam','charlie','amy','vanessa','carl','sarah'],
        'sales':[200,120,340,124,243,350]}

In [76]:
df= pd.DataFrame(data)

In [77]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [78]:
bycamp=df.groupby('company')

In [79]:
bycamp.mean()

C:\Users\hi\AppData\Local\Temp\ipykernel_6612\2463873865.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycamp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [80]:
bycamp.sum()

C:\Users\hi\AppData\Local\Temp\ipykernel_6612\2368293984.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycamp.sum()

         sales
company
fb         593
goog       320
msft       464

In [81]:
 bycamp.std()

C:\Users\hi\AppData\Local\Temp\ipykernel_6612\240564746.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycamp.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [83]:
bycamp.sum().loc['goog']

C:\Users\hi\AppData\Local\Temp\ipykernel_6612\3660229162.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycamp.sum().loc['goog']

sales    320
Name: goog, dtype: int64

In [85]:
df.groupby('company').median().loc['msft']

C:\Users\hi\AppData\Local\Temp\ipykernel_6612\2103453870.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.median is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('company').median().loc['msft']

sales    232.0
Name: msft, dtype: float64

In [86]:
df.groupby('company').count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [90]:
df.groupby('company').min()

          person  sales
company
fb          carl    243
goog     charlie    120
msft         amy    124

In [97]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging joining and concatenation

In [98]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [99]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [100]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [101]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [102]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [103]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [108]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [109]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [110]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [111]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [114]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [115]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [117]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [122]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [126]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [127]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [128]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [129]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [131]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [132]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# operations

In [138]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[333,444,555,444],
                  'col3':['abc','def','ars','ist']})

df.head()

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   555  ars
3     4   444  ist

In [139]:
df['col2'].unique()

array([333, 444, 555], dtype=int64)

In [140]:
df['col2'].value_counts()

444    2
333    1
555    1
Name: col2, dtype: int64

In [141]:
df

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   555  ars
3     4   444  ist

In [142]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [146]:
def times2(x):
    
    return x*2

In [147]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [148]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [149]:
df['col2'].apply(lambda x: x*2)

0     666
1     888
2    1110
3     888
Name: col2, dtype: int64

In [150]:
df

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   555  ars
3     4   444  ist

In [151]:
df.drop('col1',axis=1)

   col2 col3
0   333  abc
1   444  def
2   555  ars
3   444  ist

In [152]:
df

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   555  ars
3     4   444  ist

In [154]:
 df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [155]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [156]:
df

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   555  ars
3     4   444  ist

In [158]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   333  abc
1     2   444  def
3     4   444  ist
2     3   555  ars

In [160]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Input and Output

In [161]:
pwd

'C:\\Users\\hi\\Desktop\\data science\\jupyter notebook files\\jupyter file'

In [162]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hi\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hi\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [163]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\hi\anaconda3\lib\site-packages (4.9.2)

In [165]:
!pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\hi\anaconda3\lib\site-packages (4.12.2)
Requirement already satisfied: soupsieve>1.2 in c:\users\hi\anaconda3\lib\site-packages (from BeautifulSoup4) (2.4)

In [166]:
pwd

'C:\\Users\\hi\\Desktop\\data science\\jupyter notebook files\\jupyter file'

In [178]:
df= pd.read_csv('example.csv')

In [180]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [186]:
df.to_csv('My_output',index=False)

In [187]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [190]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [196]:
data= pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [197]:
type(data)

list

In [200]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
...,...,...,...,...,...,...,...
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645